{
  "mcp-servery-5-grablei-na-praktike": "Разбирает 5 типичных граблей MCP-серверов: stdout pollution ломает JSON-RPC, axios proxy конфликтует с MCP, REST-мышление не работает для агентов, schema drift между сервером и клиентом, конфигурационные проблемы. Практические решения для каждой проблемы.",
  "docker-ufw-port-closed-but-open": "Разбирает проблему того, что Docker обходит UFW, создавая собственные iptables-цепочки. Порт закрыт в UFW, но доступен извне через Docker. Три решения: DOCKER-USER chain, daemon.json с iptables:false, docker network internal.",
  "gde-hostit-v-rossii-2026": "Гайд по хостингу в России после блокировок Vercel, Heroku, Netlify. Сравнение Timeweb, Beget, Selectel. Грантовые программы для стартапов. Пошаговая миграция за час.",
  "git-worktrees-hugo-ab-testing": "Использование git worktrees для параллельного A/B-тестирования дизайна Hugo-сайта. Один промпт Claude Code создаёт три worktree с Hugo-серверами на разных портах для сравнения вариантов в браузере.",
  "prd-first-step-vibe-coding": "Объясняет почему PRD нужен до написания кода при вайб-кодинге. Без спецификации AI выбирает среднестатистическое решение. Шаблон PRD из 4 пунктов. Пример с Hugo-блогом ifonin.ru.",
  "ot-vayb-kodinga-k-agentnomu-inzhiniringu": "Пост описывает эволюцию от вайб-кодинга к структурированному агентному инжинирингу через три стадии: brainstorm (развёртывание идеи с уточняющими вопросами), plan (организация работы в независимые задачи) и execute (параллельное выполнение с субагентами). Автор обосновывает переход необходимостью масштабирования, указывая, что вайб-кодинг приводит к накоплению дефектов и контекст-дрифту, тогда как структурированный процесс со SKILL.md, human gates и параллельным выполнением обеспечивает предсказуемость и воспроизводимость результатов.",
  "context-engineering-novaya-paradigma": "Что такое context engineering, почему prompt engineering недостаточна, и четыре паттерна оптимизации контекста в Claude Code",
  "kak-ustroen-kontekst-vnutri": "Разбираем архитектуру контекстного окна Claude Code: четыре слоя, невидимые буферы, cliff points деградации и практический мониторинг. От объявленных 200K к реальным 120K.",
  "compaction-tryokhsloynaya-sistema-szhati": "Разбор трёхслойной системы сжатия контекста в Claude Code: micro-compaction для автоматического удаления tool outputs, auto-compaction при достижении 77-78% заполнения с reconstruction-grade summary, и manual /compact для проактивного управления. Описание механизмов работы каждого слоя, rehydration для восстановления состояния, и практические кейсы использования.",
  "claudemd-persistentnaya-pamyat-proekta": "Статья описывает CLAUDE.md как файл персистентной памяти проекта в Claude Code, представляя пятиуровневую иерархию (Enterprise - User - Project - Subdirectory - Rules) и модульную систему .claude/rules/ v2.0.64+. Разбираются четыре антипаттерна (bloated файлы, неправильное понимание enforcement, дублирование, устаревшие правила) и три практических кейса оптимизации персистентного контекста.",
  "ai-slop-v-interfejsah-i-kak-s-nim-borot": "Статья рассматривает проблему однородности AI-генерируемых интерфейсов (\"AI slop\") — использование типовых шрифтов, цветов и макетов, возникающих из-за стандартизации в training data моделей. Для решения проблемы предлагаются два подхода: Frontend-Design Skill для реактивного улучшения компонентов во время кодирования через явные дизайн-принципы и UI UX Pro Max для профилактического создания машинно-читаемой дизайн-системы перед началом разработки с учётом специфики индустрии. Оба скилла работают дополняющим друг друга способом, позволяя создавать distinctive интерфейсы вместо generic шаблонов, начиная от первой итерации проекта.",
  "audit-claude-md-kontekst-proekta": "Автор решил проблему переполнения контекста в Claude Code, создав команду /audit-claude-md, которая анализирует и оптимизирует файл CLAUDE.md проекта. Команда сканирует контекст, находит дублирование, устаревшие ссылки и конфликты в инструкциях, выдавая конкретные рекомендации по оптимизации структуры и экономии токенов. На практике инструмент позволил сократить размер контекста с 2000 до 1200 токенов и экономит около 6-7 тысяч токенов на каждую сессию работы.",
  "exa-mcp-vs-webfetch-claude-code": "Пост сравнивает WebFetch и Exa MCP для поиска информации в Claude Code. WebFetch выдаёт только резюме страниц, что критично для API-документации - параметры и схемы теряются, код пишется на угадку. Exa MCP с инструментом get_code_context_exa возвращает полный текст с примерами кода из реальных репозиториев. Установка одной командой, стоит 5 долларов за тысячу запросов.",
  "8-ai-agentov-vmesto-analitika": "Автор построил пайплайн из 8 специализированных AI-агентов для автоматизации исследований рынка, который заменил недели ручной работы на ночной процесс получения полного анализа конкурентов и аудитории через JTBD-фреймворк. Ключевые компоненты системы включают синтетическое моделирование пользовательских профилей, extraction паттернов и file-based handoff между агентами, но синтетика генерирует только гипотезы, требуя финальной валидации на реальных пользователях. Главный вывод: AI освобождает от рутины данных и документирования, позволяя сосредоточиться на стратегии и интерпретации причинно-следственных связей, которые машина находит как паттерны, но не объясняет.",
  "claude-code-logs-content-mining": "Автор создал систему, которая автоматически анализирует логи Claude Code и генерирует идеи для статей через три этапа: фильтрация шума локально, параллельный анализ маленькими агентами и синтез результатов. Главная проблема - деградация сигнала при рекурсивной обработке своих же выводов, что приводит к эхо-камере, придуманным паттернам и дублям, решить которую помогает human review и логирование причин отклонённых идей."
}
